{
    "Alabama": "The world record for walking barefoot on LEGO bricks is 8,355 meters, set in Rogersville, Alabama.",
    "Alaska": "Alaska has the longest coastline of any U.S. state, 6,640 miles, longer than all the other states combined.",
    "Arizona": "The bola tie was designated the official neckware of Arizona in 1973.",
    "Arkansas": "Arkansas has the only active diamond mine in the U.S., in Crater of Diamonds State Park.",
    "California": "San Francisco's cable cars were named the first moving National Historic Landmark.",
    "Colorado": "Colorado contains the world's largest hot mineral pool (Glenwood Springs) and deepest hot springs (the Mother Spring aquifer in Pagosa Springs).",
    "Connecticut": "In 1901, Connecticut was the first state in the United States to impose a numerical speed limit for motor vehicles, setting the maximum legal speed to 12 mph in cities and 15 mph on rural roads.",
    "Delaware": "Delaware allows a marriage to be annulled if it was done as a dare.",
    "Florida": "The last time snow fell in Miami, Florida, was January 17, 1977.",
    "Georgia": "Georgia is home to The Tree That Owns Itself, a white oak tree in Athens that is said to legally have ownership of itself",
    "Hawaii": "Even though Hawaii is a U.S. state, it is not geographically part of the North American continent.",
    "Idaho": "Idaho's Hell's Canyon is much deeper than the Grand Canyon, 7,993 feet at its deepest point.",
    "Illinois": "All modern penicillin can be traced to the mold found on a single cantaloupe from a grocery store in Peoria, Illinois.",
    "Indiana": "In Indiana, The U.S. Navy manages a forest of old-growth white oak trees needed for restoration of the USS Constitution, the world's oldest naval vessel still afloat.",
    "Iowa": "Dewey Readmore Books, a kitten abandoned in Spencer Public Library's dropbox, went on to become one of the most famous library cats and was featured in children's books and documentaries.",
    "Kansas": "Evidence of helium was first observed on the sun, but the first helium discovered on earth was in Kansas.",
    "Kentucky": "Kentucky is home to the largest underground cave system in the world: the Mammoth-Flint Ridge Cave system is at least 400 miles long.",
    "Louisiana": "The Law of Louisiana is different from all other state laws in the US? The other 49 states base their interpretation of the law on what is referred to as “common law,” Louisiana law derives from Napoleonic Code.",
    "Maine": "The summit of Mars Hill, near the Canadian border, is the first place to see the sun rise in the US during the summer. The summit of Cadillac Mountain is the first place to see the sun rise in the winter.",
    "Maryland": "Maryland has is the oldest U.S. state capitol in continuous legislative use, dating to 1772.",
    "Massachusetts": "Killing or frightening a pigeon in Massachusetts is punishable by a fine of up to $20 and imprisonment of up to a month.",
    "Michigan": "The five-mile long Mackinac bridge connects the lower and upper peninsulars of Michigan. Painting the brige takes 7 years.",
    "Minnesota": "Minnesota contains some of the oldest rocks on Earth, granitic gneisses that formed aound 3,600 million years ago, 80% of the age of the Earth.",
    "Mississippi": "Mississippi has the highest child vaccination rates in the U.S.",
    "Missouri": "Sliced bread, and bread slicing machines, were invented in Missouri in the 1920s.",
    "Montana": "Montana has the most number of nonprofits per capita in the U.S.",
    "Nebraska": "Nebraska has been scientifically proven to be flatter than a pancake.",
    "Nevada": "Nevada contains the only geysers in the U.S. outside Yellowstone National Park.",
    "New Hampshire": "There is only one telephone area code in New Hampshire, 603.",
    "New Jersey": "The C. A. Nothnagle Log House was built circa 1640 by Finnish or Swedish settlers, and is the oldest surviving log cabin in the U.S.",
    "New Mexico": "New Mexico used to be home to giant ground sloths, which were the size of modern elephants.",
    "New York": "New York was the first state to require license plates on automobiles",
    "North Carolina": "North Carolina contains ancient bald cypress trees over 2,000 years old, with one tree observed to be at least 2,624 years old.",
    "North Dakota": "Two towns in North Dakota claim to be the geographic center of North America: Rugby, and Center.",
    "Ohio": "Columbus is often used to test market new products because its demographics closely match America as a whole.",
    "Oklahoma": "Oklahoma's official State Rock Song is \"Do You Realize\" by the Flaming Lips.",
    "Oregon": "Portland, Oregon is named after Portland, Maine. The name was chosen over Boston with a best-of-three coin toss.",
    "Pennsylvania": "The Leap-the-Dips roller coaster in Altoona, Pennsylvania was built in 1902 and is a National Historic Landmark.",
    "Rhode Island": "Rhode Island may be the smallest state by area, but it is the second-most densely populated.",
    "South Carolina": "South Carolina experiences 10-15 small earthquakes annually.",
    "South Dakota": "In January 1943, chinook winds blowing in Spearfish caused the temperature to rise from -4°F to 49°F in two minutes, then fall back to -4°F",
    "Tennessee": "Tennessee is home to Graceland, the home and final resting place of Elvis Presley.",
    "Texas": "Despite the name, the Railroad Commission of Texas actually regulates the oil and gas industry.",
    "Utah": "Utah's state reptile is the Gila monster, the only venomous lizard native to the U.S.",
    "Vermont": "Old homes in Vermont often have diagonal windows set at an angle to prevent witches flying through them on broomsticks.",
    "Virginia": "Virginia contains three volcanoes, but the most recent eruption was 35 million years ago.",
    "Washington": "Boeing's Everett Factory, in Seattle, is the world's largest building by volume.",
    "Washington DC": "Washington D.C. has many museums, including the free National Bonsai & Penjing Museum.",
    "West Virginia": "The New River Gorge bridge, one of the highest vehicle bridges in the world, hosts an annual BASE jumping festival for people to parachute jump from the bridge.",
    "Wisconsin": "Almost all of the herbal supplement ginseng that is grown in the U.S. is processed in Marathon County in central Wisconsin.",
    "Wyoming": "Wyoming was the first state to allow women the right to vote and become politicians, as well as the first state to elect a female governor."
}